#Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку. 
# Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. 
# Якщо номер не містить міжнародного коду, функція автоматично додає код '+38' (для України). Це гарантує, що всі номери будуть придатними для відправлення SMS.



#Вимоги до завдання:

#Параметр функції phone_number - це рядок з телефонним номером у різноманітних форматах.
#Функція видаляє всі символи, крім цифр та символу '+'.
#Якщо міжнародний код відсутній, функція додає код '+38'. Це враховує випадки, коли номер починається з '380' (додається лише '+') та коли номер починається без коду (додається '+38').
#Функція повертає нормалізований телефонний номер у вигляді рядка.


#Рекомендації для виконання:

#Використовуйте модуль re для регулярних виразів для видалення непотрібних символів.
#Перевірте, чи номер починається з '+', і виправте префікс згідно з вказівками.
#Видаліть всі символи, крім цифр та '+', з номера телефону.
#На забувайте повертати нормалізований номер телефону з функції.



phone_number = ("    +38(050)123-32-34", 
                "     0503451234", 
"(050)8889900", 
"38050-111-22-22", 
"38050 111 22 11   ")

cleaned_phone_number = tuple(number.strip()
                        .replace(" ", "")
                         .replace("-", "")
                         . replace("(", "")
                         .replace(")", "") 
                         for number in phone_number)
print(cleaned_phone_number)

def normalize_phone(cleaned_phone_number):
    if cleaned_phone_number.startswith ("+"):
        return cleaned_phone_number
    else:
        return "+38" + cleaned_phone_number if cleaned_phone_number.startswith ("0") else "+" + cleaned_phone_number


normalized_phone_number = tuple(normalize_phone(cleaned_phone_number) for cleaned_phone_number in cleaned_phone_number)
print(normalized_phone_number)